tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# More intuitive version of du in rust
brew "dust"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Read your tfstate or HCL to generate a graph
brew "inframap"
# Tool to monitor I/O latency in real time
brew "ioping"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive environments for writing and running code
brew "jupyterlab", link: false
# Run local Kubernetes cluster in Docker
brew "kind"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# C interface for Google's OS library for Machine Intelligence
brew "libtensorflow"
# File compressor
brew "lzop"
# Utility for directing compilation
brew "make"
# Modern and intuitive terminal-based text editor
brew "micro"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Fast, highly customisable system info script
brew "neofetch"
# Oracle Cloud Infrastructure CLI
brew "oci-cli"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Simulation game based upon Transport Tycoon Deluxe
brew "openttd"
# Painless compression and decompression for your terminal
brew "ouch"
# Tensors and dynamic neural networks
brew "pytorch", link: false
# Emulator for x86 and PowerPC
brew "qemu"
# Utility for computing and verifying hash sums of files
brew "rhash"
# CLI for managing and maintaining data graphs with Apollo Studio
brew "rover"
# Safe, concurrent, practical language
brew "rust"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Lightweight BitTorrent client
brew "transmission-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Team communication and collaboration software
cask "slack"
# Virtual machines UI using QEMU
cask "utm"
# RSS and Atom reader
cask "vienna"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "kubescape.kubescape"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "platformio.platformio-ide"
vscode "qiqigou.tpl-lang"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "waderyan.gitblame"
