tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Fast, highly customisable system info script
brew "neofetch"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Painless compression and decompression for your terminal
brew "ouch"
# UNIX shell (command interpreter)
brew "zsh"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Bitcoin client and wallet
cask "bitcoin-core"
# Web browser
cask "google-chrome"
# Open-source code editor
cask "visual-studio-code"
# Lossless audio decoder
cask "xld"
mas "Xcode", id: 497799835
